{
  "chinese": [
    "請用三分鐘介紹你自己。",
    "你為什麼選擇我們學校？",
    "你最喜歡的中文課文是什麼？為什麼？",
    "你平時如何提升你的中文寫作能力？",
    "你最近讀過的一本中文書是什麼？有什麼感想？",
    "你如何看待中文在現代社會的重要性？",
    "請用中文描述你的一次難忘經歷。",
    "你認為學習中國文化有什麼意義？",
    "你最欣賞的中國文學作品是什麼？為什麼？",
    "你如何平衡中文學習和其他學科的關係？",
    "你認為自己的中文能力如何？有哪些方面需要改進？",
    "請分享一次你在中文學習上遇到的挑戰及如何克服。",
    "你喜歡閱讀哪些類型的中文書籍？為什麼？"
  ],
  "english": [
    "Tell us about yourself in three minutes.",
    "Why do you want to study at our school?",
    "What is your favorite book and why?",
    "How do you improve your English outside of school?",
    "Describe a challenge you have overcome.",
    "What are your strengths and weaknesses?",
    "Where do you see yourself in five years?",
    "How do you handle pressure and stress?",
    "What extracurricular activities are you interested in?",
    "What qualities do you think are important for a student at our school?",
    "How do you stay motivated when facing difficulties?",
    "What is your proudest achievement so far?",
    "How do you plan to contribute to our school community?"
  ],
  "math": [
    "What do you find most interesting about mathematics?",
    "Explain how you would solve a difficult math problem.",
    "How do you apply mathematics in your daily life?",
    "What is your favorite mathematical concept and why?",
    "Describe a time when you used logic to solve a problem.",
    "How would you explain fractions to a younger student?",
    "What mathematical achievement are you most proud of?",
    "How do you approach a math problem you don't understand?",
    "What's the connection between mathematics and other subjects?",
    "Can you give an example of how mathematics is used in the real world?",
    "What is the most challenging math problem you have solved?",
    "How does math help develop critical thinking skills?",
    "What math-related activities do you enjoy outside of school?"
  ],
  "manner": [
    "How would you handle a disagreement with a classmate?",
    "Describe a time when you showed leadership.",
    "What does good teamwork mean to you?",
    "How do you handle stress during exams?",
    "What would you do if you saw someone being bullied?",
    "How do you balance schoolwork and extracurricular activities?",
    "What qualities make a good student in our school?",
    "How do you contribute to your community?",
    "What would you do if you made a mistake in a group project?",
    "How do you show respect to teachers and classmates?",
    "How do you prioritize your tasks and responsibilities?",
    "What would you do if you disagreed with a teacher's decision?",
    "How do you handle failure or disappointment?"
  ],
  "schoolSpecific": {
    "英華書院": [
      "你對英華書院的歷史和傳統有多少了解？",
      "英華書院以STEM教育聞名，你對哪個科學領域特別感興趣？",
      "你如何平衡學術成績和課外活動？",
      "你認為男校教育有什麼特點和優勢？",
      "你對英華書院的音樂或體育活動有什麼認識？",
      "你如何看待基督教價值觀在教育中的角色？",
      "你期望在英華書院獲得什麼樣的成長？"
    ],
    "聖保羅男女中學": [
      "聖保羅男女中學以學術卓越著稱，你如何應對學術挑戰？",
      "你認為男女同校教育有什麼優勢？",
      "你對IB課程有什麼了解和期望？",
      "你如何培養國際視野和跨文化理解能力？",
      "你認為領導才能可以如何培養和發展？",
      "你如何看待聖保羅的學術傳統和創新精神？",
      "你期望如何為學校社區作出貢獻？"
    ],
    "宣道會陳瑞芝紀念中學": [
      "你對宣道會陳瑞芝紀念中學的基督教教育理念有什麼看法？",
      "你如何參與社區服務活動？",
      "你對藝術和創意表達有什麼興趣？",
      "你如何看待屯門區的教育環境和發展？",
      "你如何實踐關愛他人和服務社區的精神？",
      "你對學校的藝術發展課程有什麼期望？",
      "你如何將信仰與學習生活結合？"
    ],
    "保良局董玉娣中學": [
      "保良局董玉娣中學注重科技教育，你對哪些科技領域感興趣？",
      "你如何看待體育在學生發展中的重要性？",
      "你對保良局的教育理念有什麼認識？",
      "你如何規劃自己的未來職業發展？",
      "你對學校的科技實驗室和設施有什麼期望？",
      "你如何看待團隊合作在學習中的重要性？",
      "你如何將科技知識應用於解決實際問題？"
    ]
  }
}