{
  "chinese": [
    "[WY] 閱讀一篇文章並回答相關問題。（4分鐘準備）",
    "[WY] 如何營造一個環保校園？",
    "[WY] 你是否贊成中學生未婚產子？",
    "[WY] 怎樣看網上欺凌？",
    "請用三分鐘介紹你自己。",
    "你為什麼選擇我們學校？",
    "你最喜歡的中文課文是什麼？為什麼？",
    "你平時如何提升你的中文寫作能力？",
    "你最近讀過的一本中文書是什麼？有什麼感想？",
    "你如何看待中文在現代社會的重要性？",
    "請用中文描述你的一次難忘經歷。",
    "你認為學習中國文化有什麼意義？",
    "你最欣賞的中國文學作品是什麼？為什麼？",
    "你如何平衡中文學習和其他學科的關係？"
  ],
  "english": [
    "[FW] What is your name? Which school do you come from?",
    "[FW] Please tell me something about yourself.",
    "[FW] Please introduce your family.",
    "[FW] What are your favourite sports?",
    "[FW] Why do you want to study in our school?",
    "[FW] Why do you want to get into this school?",
    "[FW] Why do you choose our school?",
    "[FW] What are your hobbies?",
    "[FW] What are your strength and weakness?",
    "[FW] Who is your best friend?",
    "[FW] Who do you respect the most?",
    "[FW] Do you have any special skills or talents?",
    "[FW] Do you have any duties at school?",
    "[FW] Do you have any leadership experience?",
    "[FW] How do you spend your leisure time?",
    "[FW] Which school is your second choice? Why?",
    "[FW] Who is your idol?",
    "[FW] Who do you admire the most? Why?",
    "[FW] Who is your favourite author?",
    "[FW] What is your general feelings towards your primary school?",
    "[FW] Do you think our school can excel your potential to the full? Why?",
    "[FW] If you face difficulties or problems, how do you overcome them?",
    "[FW] Which is your favourite festival? Why?",
    "[FW] Can you briefly introduce the background of our school?",
    "[FW] How often do you read newspapers?",
    "[FW] Do you have any habits of using social media? How often do you use it?",
    "[FW] What is your dream when you grow up?",
    "[FW] Do you want to join the Olympics? Which sports do you want to join?",
    "[FW] Do you prefer to watch a movie at home or in the cinema? Why?",
    "[FW] If you can choose to be an animal, what kind of animals would you like to be?",
    "[FW] Do you like English? Why/ why not?",
    "[FW] Please introduce yourself.",
    "[FW] Which is your favourite festival?",
    "[FW] How often do you use computers?",
    "[FW] If you have difficulties, what will you do?",
    "[FW] Please suggest 2 ways to make primary students happier.",
    "[FW] If your friend is coming to visit Hong Kong, what will you do with him and where will you bring him to?",
    "[FW] How do you celebrate Father's Day / Mother's Day?",
    "[FW] Do you prefer individual or group activities?",
    "[FW] Which is your favourite subject in your primary school?",
    "[FW] Do you think tutorial class can help? Is it beneficial?",
    "[FW] What extra-curricular activities do you have?",
    "[FW] Do you prefer e-books or real books?",
    "[FW] Why do many teenagers want to be yourselves?",
    "[FW] Do you want to take part-time jobs when you are 18?",
    "[FW] What activities are healthy and interesting?",
    "[FW] Do you spend too much time on something you like?",
    "[FW] Do you suggest having lessons on zoom?",
    "[FW] Please share your learning experience.",
    "[FW] How do you distribute your time when there are many subjects in secondary school?",
    "[FW] Which school is your second choice?",
    "[FW] If you had one million dollars, how would you spend the money?",
    "[FW] How do you spend your weekends / holidays?",
    "[FW] What are the pros and cons of using the Internet?",
    "[WY] Read aloud the passage and answer the related questions. (4 mins preparation time)",
    "[WY] What is your favourite breakfast and why?",
    "[WY] What would you do if your siblings did not have breakfast before going to school?",
    "Tell us about yourself in three minutes.",
    "Why do you want to study at our school?",
    "What is your favorite book and why?",
    "How do you improve your English outside of school?",
    "Describe a challenge you have overcome.",
    "What are your strengths and weaknesses?",
    "Where do you see yourself in five years?",
    "How do you handle pressure and stress?",
    "What extracurricular activities are you interested in?",
    "What qualities do you think are important for a student at our school?"
  ],
  "math": [
    "What do you find most interesting about mathematics?",
    "Explain how you would solve a difficult math problem.",
    "How do you apply mathematics in your daily life?",
    "What is your favorite mathematical concept and why?",
    "Describe a time when you used logic to solve a problem.",
    "How would you explain fractions to a younger student?",
    "What mathematical achievement are you most proud of?",
    "How do you approach a math problem you don't understand?",
    "What's the connection between mathematics and other subjects?",
    "Can you give an example of how mathematics is used in the real world?"
  ],
  "current": [
    "你對香港最近的社會議題有什麼看法？",
    "你如何評價香港的教育制度？",
    "你認為科技發展對社會有什麼影響？",
    "你對環境保護有什麼認識和建議？",
    "你如何看待人工智能的發展與應用？",
    "你認為年輕人應該如何參與社會事務？",
    "你對香港的未來發展有什麼期望？",
    "你如何看待全球化帶來的機遇與挑戰？",
    "你認為香港在國際上的定位是什麼？",
    "你對可持續發展有什麼理解？"
  ],
  "science": [
    "你對哪個科學領域最感興趣？為什麼？",
    "描述一個你印象深刻科學實驗或發現。",
    "科學在日常生活中扮演什麼角色？",
    "你如何理解科學方法？",
    "你認為未來最重要的科學突破會是什麼？",
    "科技如何改變我們的生活方式？",
    "你如何評價科學與倫理的關係？",
    "你對太空探索有什麼看法？",
    "你認為科學教育的重要性是什麼？",
    "描述一個你想解決的科學問題。"
  ],
  "creative": [
    "如果你有一天的時間可以做任何事，你會做什麼？為什麼？",
    "描述一個你原創的想法或發明。",
    "你如何用創意解決日常生活中的問題？",
    "你認為什麼是創造力？如何培養它？",
    "如果你可以改變學校的一件事，會是什麼？為什麼？",
    "描述一個你認為很有創意的人物或作品。",
    "你如何將創意應用在學習中？",
    "如果你要設計一個新產品，會是什麼？",
    "你認為創意思維對未來社會的重要性是什麼？",
    "用三個詞形容你自己的創意特質。"
  ],
  "other": [
    "你如何定義成功？",
    "你最大的優點和缺點是什麼？",
    "你如何處理壓力和挫折？",
    "你對未來有什麼規劃？",
    "你如何平衡學業和興趣？",
    "你認為一個好的領袖應該具備什麼特質？",
    "你如何為團隊做出貢獻？",
    "你最重要的價值觀是什麼？",
    "你如何保持學習的動力？",
    "你希望在大學學習什麼專業？為什麼？"
  ],
  "schoolSpecific": {
    "英華書院": [
      "[WY] 如何營造一個環保校園？",
      "[WY] 你是否贊成中學生未婚產子？",
      "[WY] 怎樣看網下欺凌？",
      "你對英華書院的歷史和傳統有多少了解？",
      "英華書院以STEM教育聞名，你對哪個科學領域特別感興趣？",
      "你如何平衡學術成績和課外活動？",
      "你認為男校教育有什麼特點和優勢？"
    ],
    "聖保羅男女中學": [
      "聖保羅男女中學以學術卓越著稱，你如何應對學術挑戰？",
      "你認為男女同校教育有什麼優勢？",
      "你對IB課程有什麼了解和期望？",
      "你如何培養國際視野和跨文化理解能力？"
    ],
    "宣道會陳瑞芝紀念中學": [
      "你對宣道會陳瑞芝紀念中學的基督教教育理念有什麼看法？",
      "你如何參與社區服務活動？",
      "你對藝術和創意表達有什麼興趣？",
      "你如何看待屯門區的教育環境和發展？"
    ],
    "保良局董玉娣中學": [
      "保良局董玉娣中學注重科技教育，你對哪些科技領域感興趣？",
      "你如何看待體育在學生發展中的重要性？",
      "你對保良局的教育理念有什麼認識？",
      "你如何規劃自己的未來職業發展？"
    ]
  }
}